frontend/controllers/ArticleController.php

SELECT * FROM `acca_article` WHERE `alias`='tentang-kami'
---
    public function actionView() {
        $this->layout = 'mainSingle';
        $model = Article::findOne(['alias'=>$_GET['alias']]);