frontend/controllers/ProductController.php

    public function actionInvoice($id) {
        $this->layout = 'mainSingle';
        if (!\Yii::$app->user->isGuest) {
            $ryRandom = rand(11111, 99999);
            $session = Yii::$app->session;

            $model = Sell::findOne($id);
            $modelDet = SellDet::find()->where(['sell_id' => $id])->all();
            $modelInfo = SellInfo::findOne(['sell_id' => $id]);
---
SELECT * FROM `acca_sell` WHERE `id`='121'
SELECT * FROM `acca_sell_det` WHERE `sell_id`='121'
SELECT * FROM `acca_sell_info` WHERE `sell_id`='121'