frontend/controllers/ProductController.php

SELECT * FROM `acca_city` WHERE `id`='508'
INSERT INTO `acca_sell` (`departement_id`, `customer_user_id`, `subtotal`, `created`) VALUES (1, 823, 0, '2015-10-20 11:59:08')
---
    public function actionDestination() {
        $this->layout = 'mainSingle';
        if (!empty($_POST['city_id'])) {
            $session = Yii::$app->session;
            $city = City::findOne($_POST['city_id']);


            $model = new Sell;

            $model->departement_id = 1;
            $model->customer_user_id = Yii::$app->user->identity->id;
            $model->subtotal = 0;
            $model->created = date('Y-m-d H:i:s');

//            $model->save();


            $value = $session['cart'];
            if (!empty($value)) {
                if ($model->save()) {

SELECT * FROM `acca_product` WHERE `id`=2482
---
                    $is_asuransi = '';

                    foreach ($value as $product_id => $qty) {
                        $product = Product::findOne($product_id);

SELECT * FROM `acca_sell` WHERE `id`=121
---
                        $chekasuransi = 0;
                        $is_asuransi = 0;
                    }
                    $modleTot = Sell::findOne($model->id);

SELECT * FROM `acca_sell` WHERE `id`=121
SELECT * FROM `acca_user` WHERE `id`=823
---

                    $sellDet = SellDet::find()->where(['sell_id' => $model->id])->all();
                    $sellInfo = SellInfo::find()->where(['sell_id' => $model->id])->one();
                    $sell = Sell::findOne($model->id);
                    $user = User::findOne(Yii::$app->user->identity->id);

SELECT * FROM `acca_product` WHERE `alias`='nokia-225'
SELECT * FROM `acca_product_photo` WHERE `product_id`=2190
---
    public function actionView() {


        $this->layout = 'mainSingle';
        $model = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->where(['alias' => $_GET['alias']])->one();


        if (empty($model)) {
            throw new NotFoundHttpException('The requested page does not exist.');
        } else {
            $modelProductPhoto = ProductPhoto::findAll(['product_id' => $model->id]);

SELECT * FROM `acca_product_category` WHERE `id`='112'
SELECT * FROM `acca_product_category` WHERE (`root`=97) AND (`level`=2) ORDER BY `name`
SELECT * FROM `acca_product` WHERE `product_category_id` IN (143, 144, 112, 117)
SELECT * FROM `acca_product_category` WHERE `id` IN (66, 47, 76, 68)
SELECT * FROM `acca_product_photo` WHERE `id` IN (2620, 2978, 2996, 0, 2353)
SELECT * FROM `acca_product` ORDER BY RAND() LIMIT 5
SELECT COUNT(*) FROM `acca_product` WHERE `product_category_id`='112'
---
    public function actionList($id) {
        $this->layout = 'mainSingle';
        $session = Yii::$app->session;
        $show = '';
        $model = ProductCategory::findOne(['id' => $id]);
        if (empty($model)) {
            throw new NotFoundHttpException('The requested page does not exist.');
        } else {
            $modelProduct = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->where(['product_category_id' => $id]);
            $modelCat = ProductCategory::find()->with('product')->where(['root' => $model->root, 'level' => 2])->orderBy('name')->all();
            $featured = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->limit(5)->orderBy('RAND()')->all();

            //cek showing
            if (isset($session['showing'])) {
                if ($session['showing'] == 'show18') {
                    $show = 18;
                } elseif ($session['showing'] == 'show24') {
                    $show = 24;
                } else {
                    $show = 32;
                }
            } else {
                $show = 18;
            }

            $pagination = new Pagination([
                'defaultPageSize' => $show,
                'totalCount' => $modelProduct->count(),