frontend/controllers/SiteController.php

    public function actionIndex() {
        $arrival = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->limit(4)->orderBy('id desc')->all();

        $bestSeller1 = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->limit(3)->orderBy('RAND()')->all();
        $bestSeller2 = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->limit(3)->orderBy('RAND()')->all();
        $featured = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->limit(4)->orderBy('RAND()')->all();
        $popular = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->limit(4)->orderBy('hits desc')->all();
        $recently = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->limit(8)->orderBy('RAND()')->all();
        $stock = ProductStock::find()->where(['departement_id' => 1]);
        //product alone
        $alone = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->limit(1)->orderBy('RAND()')->one();
---
SELECT * FROM `acca_product_category` WHERE `id`=47
SELECT * FROM `acca_product_photo` WHERE `product_id`=1893
SELECT * FROM `acca_product` ORDER BY `id` DESC LIMIT 4
SELECT * FROM `acca_product` ORDER BY RAND() LIMIT 4
SELECT * FROM `acca_product` ORDER BY `hits` DESC LIMIT 4
SELECT * FROM `acca_product` ORDER BY RAND() LIMIT 8
SELECT * FROM `acca_product` ORDER BY RAND() LIMIT 1