frontend/views/product/destination.php


$this->title = 'Alamat tujuan pengiriman';

$province = Province::find()->all();
$city = City::find()->all();
$user = User::findOne(Yii::$app->user->identity->id);
---
SELECT * FROM `acca_province`
SELECT * FROM `acca_city`
SELECT * FROM `acca_user` WHERE `id`=823

                $count = 0;
                if (isset($session['cart'])) {
                    foreach ($session['cart'] as $key => $value) {
                        $product = Product::findOne($key);
---
SELECT * FROM `acca_product` WHERE `id`=2482