frontend/views/product/invoice.php

SELECT * FROM `acca_product` WHERE `id`=2482
---
                $total = 0;

                foreach ($modelDet as $arr) {
                    $product = Product::findOne($arr->product_id);