common/models/User.php

    public static function findIdentity($id) {
        return static::findOne(['id' => $id, 'enabled' => self::STATUS_ACTIVE]);
---
SELECT * FROM `acca_user` WHERE (`id`=823) AND (`enabled`=1)

    public static function findByUsername($username) {
        return static::findOne(['username' => $username, 'enabled' => self::STATUS_ACTIVE]);
---
SELECT * FROM `acca_user` WHERE (`username`='landa') AND (`enabled`=1)