frontend/views/layouts/main.php

SELECT * FROM `acca_product_category` WHERE `id` IN (25, 133, 66)
SELECT * FROM `acca_product_photo` WHERE `id` IN (4108, 4288, 4120)
SELECT * FROM `acca_product` ORDER BY RAND() LIMIT 3
SELECT * FROM `acca_product_category` WHERE `id` IN (128, 76, 46)
SELECT * FROM `acca_product_photo` WHERE `id` IN (4342, 3942, 3977)
SELECT * FROM `acca_product_category` WHERE `id` IN (112, 117, 38)
SELECT * FROM `acca_product_photo` WHERE `id` IN (4290, 4331, 4198)
---
                                <div class="body">
                                    <ul>
                                        <?php
                                        $featured = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->limit(3)->orderBy('RAND()')->all();
                                        $sale = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->limit(3)->orderBy('RAND()')->all();
                                        $rated = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->limit(3)->orderBy('RAND()')->all();