frontend/views/layouts/mainSingle.php

SELECT * FROM `acca_product` WHERE `id`=2482
---
                                        foreach ($session['cart'] as $key => $value) {

                                            $count += $value;
                                            $product = Product::findOne($key);

SELECT * FROM `acca_product` WHERE `id`=2482
---
                                        <?php
                                        if (isset($session['cart'])) {
                                            foreach ($session['cart'] as $key => $value) {
                                                $list = Product::findOne($key);

SELECT * FROM `acca_product_category` WHERE `id` IN (70, 47, 38)
SELECT * FROM `acca_product_photo` WHERE `id` IN (3987, 3652, 4279)
SELECT * FROM `acca_product` ORDER BY RAND() LIMIT 3
SELECT * FROM `acca_product_category` WHERE `id` IN (45, 77, 75)
SELECT * FROM `acca_product_photo` WHERE `id` IN (4155, 4374, 4271)
SELECT * FROM `acca_product_category` WHERE `id` IN (60, 26, 39)
SELECT * FROM `acca_product_photo` WHERE `id` IN (4357, 4286, 2613)
---
                                <div class="body">
                                    <ul>
                                        <?php
                                        $featured = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->limit(3)->orderBy('RAND()')->all();
                                        $sale = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->limit(3)->orderBy('RAND()')->all();
                                        $rated = Product::find()->with(['brand', 'productPhoto', 'productCategory'])->limit(3)->orderBy('RAND()')->all();