common/mail/pembelian.php

use common\models\User;
use common\models\Product;

$sellDet = SellDet::find()->where(['sell_id' => $sell_id])->all();
$sellInfo = SellInfo::find()->where(['sell_id' => $sell_id])->one();
---
SELECT * FROM `acca_sell_det` WHERE `sell_id`=121
SELECT * FROM `acca_sell_info` WHERE `sell_id`=121


$total = 0;
foreach ($sellDet as $detail) {
    $product = Product::findOne($detail->product_id);
---
SELECT * FROM `acca_product` WHERE `id`=2482